constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


thermoType
{
    type            hePsiThermo;  			
    mixture         pureMixture;
    transport       sutherland; 			//const;
    thermo          hConst;				//hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}


mixture
{
    specie
    {
        nMoles          1;
        molWeight       8314.4621;
    }
    thermodynamics
    {
        Cp              3.5;
        Cv              2.5;
        Hf              0;
    }
    transport
    {
        As              1.8723e-07;			//mu*(1+Ts)
        Ts              0.412; 				//120/291.15
        Pr              0.85;
    }
}


// ************************************************************************* //
