system/surfaceDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type                    surfaces;
libs                    (sampling);
writeControl            writeTime;
writeInterval           1e-6;
interpolationScheme     cellPointFace;
surfaceFormat           raw;

surfaces
(
    airfoil
    {
        type            patch;
        patches         (airfoil);
    }

fields          (U rho p T thermo:mu)
;

// ************************************************************************* //
